Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ) Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентВхождения</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчетПоСериям</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСериям</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоХарактеристикам</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГорючиеЖидкости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаАВС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АВСКлассификацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаАВСФилиала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АВСКлассификацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДляОтчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияМест</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАварда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоБазеМоскоречье</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьФилиала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗагружатьЦеныЕслиЕстьОстатокТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаказыватьАвтоматом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОчищатьКратностьПриНулевыхОстатках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПодлежитВозврату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьНаПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьКратностьПриЗагрузкеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппаЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>(Регл) Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованныйКод</Name>
					<Comment>очищенный артикул + производитель</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджерЗаПокупки</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппаЧестногоЗнака</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезусловныйВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеМаскиНедоступныхТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаточныйСрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/CreateVarianceAct/Ext/Module.bsl
Функция СоздатьАктОРасхожденияхПослеОтгрузки(Параметры) Экспорт
	
	//+Макрушин Е. 09.02.2026 #UT10-5665
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис CreateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. СоздатьАктОРасхожденияхПослеОтгрузки");
	
	ПараметрыСтруктура = МСКWEB.ХранилищеJSONВСтруктуру(Параметры);
	
	РезультатСтруктура = СоздатьНовыйДокументАктОРасхожденияхПослеОтгрузки(ПараметрыСтруктура);
	
	РезультатВыполнения = МСКWEB.ДанныеВJSONХранилище(РезультатСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();    
	ЗаписьЖурналаРегистрации("Web-сервис CreateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьАктОРасхожденияхПослеОтгрузки " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	//-Макрушин Е. 09.02.2026 #UT10-5665	
	
КонецФункции

Функция СоздатьНовыйДокументАктОРасхожденияхПослеОтгрузки(ПараметрыСтруктура) Экспорт
	
    ТекстОшибки = "";

	ВидАкта = "АктОРасхожденияхПослеОтгрузки";
	АктСсылка = Документы[ВидАкта].НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ПараметрыСтруктура.ГУИДДокумента);

	Если Не ЗначениеЗаполнено(АктСсылка)  Тогда
		
		ИсходныйДокумент = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.ГУИДПТУ));	
		ИсходныйДокументОбъект = ИсходныйДокумент.ПолучитьОбъект();
		
		Если ИсходныйДокументОбъект = Неопределено Тогда
			
			ТекстОшибки = "В УТ10 не найден документ Реализация товаров и услуг по ИД='" + ПараметрыСтруктура.ГУИДДокумента + "'";
			
			Результат = СформироватьСтруктуруОтвета(ТекстОшибки);				
			Возврат Результат;  
			
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыСтруктура.ТабличнаяЧасть) = Тип("ХранилищеЗначения") Тогда
			ТаблТов = МСКWEB.ХранилищеJSONВСтруктуру(ПараметрыСтруктура.ТабличнаяЧасть);
		Иначе
			ТаблТов = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ПараметрыСтруктура.ТабличнаяЧасть);
		КонецЕсли;
		
		ТаблТов.Свернуть("Номенклатура, КомментарийМенеджера", "Количество");
		
		Если ТаблТов.Количество() = 0 Тогда
		
			ТекстОшибки = "Из УТ10 передана пустая табличная часть";
			
			Результат = СформироватьСтруктуруОтвета(ТекстОшибки);				
			Возврат Результат; 
			
		КонецЕсли;
			
		Для Каждого Строка Из ТаблТов Цикл
			Строка.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ",Строка.Номенклатура);
		КонецЦикла;			
			
		ДопПараметры = Новый Структура("ВебСервисУТ10, Комментарий, ДатаДокумента, НомерДокумента, IDСклада");
		ЗаполнитьЗначенияСвойств(ДопПараметры, ПараметрыСтруктура);
		ДопПараметры.Вставить("ВебСервисУТ10", Истина);
		ДопПараметры.Вставить("ИДДокументаВСмежнойБазе", ПараметрыСтруктура.ГУИДДокумента);
                      
		Если ПараметрыСтруктура.Свойство("РасхожденияКМ") Тогда
			
			Если ТипЗнч(ПараметрыСтруктура.РасхожденияКМ) = Тип("ХранилищеЗначения") Тогда
				ТаблРасхожденияКМ = МСКWEB.ХранилищеJSONВСтруктуру(ПараметрыСтруктура.РасхожденияКМ);
			Иначе
				ТаблРасхожденияКМ = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ПараметрыСтруктура.РасхожденияКМ);
			КонецЕсли;
			
			Для Каждого СтрокаРасхожденияКМ Из ТаблРасхожденияКМ Цикл
				
				СтрокаРасхожденияКМ.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаРасхожденияКМ.Номенклатура);
				СтрокаРасхожденияКМ.КодМаркировки = Справочники.ШтрихКодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", СтрокаРасхожденияКМ.КодМаркировки);
				
			КонецЦикла;

			ДопПараметры.Вставить("ТаблРасхожденияКМ", ТаблРасхожденияКМ);
			
		КонецЕсли;
			
	
		//Создаем акт
		Попытка
			
			АктСсылка = МСКWEB.СоздатьАктОРасхожденияхПослеОтгрузкиВебСервисУТ10(ИсходныйДокумент, ТаблТов, ДопПараметры);
			
			Если ЗначениеЗаполнено(АктСсылка) И Не АктСсылка.Проведен Тогда
				
				ТекстОшибки = "Ошибка при проведении документа, документ записан '"+Строка(АктСсылка)+"'"; 					
				
				Результат = СформироватьСтруктуруОтвета(ТекстОшибки);
				Возврат Результат;
				
			КонецЕсли; 
			
		Исключение
				
			ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = "Ошибка при создании документа " + ВидАкта + " на основании '"+Строка(ИсходныйДокумент)+"'" + Символы.ПС + ИнформацияОбОшибке;
			
			Результат = СформироватьСтруктуруОтвета(ТекстОшибки);
			Возврат Результат; 
			
		КонецПопытки;
			
	Иначе
		
		ТекстОшибки = "В УТ10 уже найден " + ВидАкта + " по реквизиту ИД документа в смежной базе='" + ПараметрыСтруктура.ГУИДДокумента + "'";
		
		Результат = СформироватьСтруктуруОтвета(ТекстОшибки);		
		Возврат Результат; 
		
	КонецЕсли;
		
	Результат = СформироватьСтруктуруОтвета();	
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьСтруктуруОтвета(ТекстОшибки = "") 
	
	Ответ = Новый Структура("Результат,ТекстОшибки");
	Ответ.Результат = ?(ЗначениеЗаполнено(ТекстОшибки), Ложь, Истина);
	Ответ.ТекстОшибки = ТекстОшибки;  
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЗаписьЖурналаРегистрации("Загрузка документа АктОРасхожденияхПослеОтгрузки через CreateVarianceAct", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка создании акта о расхождениях после отгрузки, CreateVarianceAct " + СокрЛП(ТекстОшибки));
	КонецЕсли; 	     
	
	Возврат Ответ; 	 
	
КонецФункции
